#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "07f834cb6227fe085b553930003bb5de" -> "56f1c5926717369f7e1dccfab9d9e6eb"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "aa75907c18e421b4ceccba3de1d6c7ae" -> "2567aa429f54399767c9c5957a14c77f"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bdc7713041da0068c12978d436d66803" -> "e3c79f44b210e35f61e9a7240b5153d3"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "453e4384c736fa1797d4438e122bbf71" -> "a1af633d94744ee779f2fb9e85f54887"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "2d7bcd3117c5a158f2a8b5b902d7a7ff" -> "11850da3badb17f0103692b381465df6"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "a9b24088629c5aa5a588e451965ed616" -> "f9168355ca3a47c45bf58370cc23e882"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e959a9c9461fcefec688df50db184ae9" -> "44d8912cab1dfcea90a5f4ad58dc1cc2"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "bbc72e87c03b5d8fa5c1f7b98f81d8c6" -> "bc49b389bb6615fd084f25f1a3d8c68a"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a19cd238838913055f074a41b949e872" -> "c46a63b7ce41e043fcf7b3a524c5563d"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "601ff53a29a4e23d68d01161340436ac" -> "745e3ac238d9c45b6caa399e43701419"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "8d259c495fe20b773fd78167aae6cb8d" -> "24a4cd1f6722ad88ef044adf0026728e"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "7c7a5708cd1f541f77db2e6e2fc527cb" -> "d81e4db0f8158f885d4e5c614102e0e3"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "d1a17e0fab4c38041a8f468d97251217" -> "83eb790b44680c343b8f337494d85a04"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "09f0d2410641ad2d3fbf33ef3417c8b3" -> "ac91c1c5452732caa169ab6af4766c20"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f3f6c5665297d31021033353f1f955bb" -> "b5c4e4f5a1a4ee4edc1a30ba1fc75869"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e9652ab12003c7f37ce5b9ce079bfb7b" -> "4ec8c5b749df6fb5fa0096cfad6be22b"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "e61137c0a52c4c8bf97273e6b68618dd" -> "57f3b16cf7d56a4b6a879b7d62e3ba8c"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "bfe60566e68821c87ec1124c3b60ac15" -> "a32a6811f7c7bdd6a5216252a293e992"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "83d7e39948a32745c3e00acfa81f0775" -> "c5c6e1b7cf159742bcff50c23f9c693b"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e4131bd38321bcc8dae9b4b2d9ae606e" -> "b1b44fa32103ad69c91521add8fc0cdf"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c1c2b6d8fb2fe63a419fb344fb14543d" -> "025daaa6d44626ddbc28d18876bc9972"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "9e7953263f48b90be8c58ee4a39c66f8" -> "86aae5dac58b297fd19035c0ebe1caf4"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "2f8c370c7f6c89ad51dbbc9bede93fdc" -> "3721200e9a0990b1bce36181fa104384"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "7d9f0191effde14274151ee9a62a55b7" -> "208394a69f10ec75a40affa66a459a15"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "8c7e59b21f5137167371e416dd60d597" -> "9cdf251556c276fad3c0793613963364"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "cd0034257356293578248885a6547dcf" -> "33437e23f72f823dd123597228c9f2a2"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "8d5bd82bb8566de2dda53e4b84b423dd" -> "ceff7feaf2e52b60b01696cbb3345362"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "15bf5b42b757fbfdd79dd7e3a6aa1f20" -> "ddc3e4360868f68d6ee4695bbfb075ef"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "99b177d1995b2054bb58617041baed0f" -> "ac7734c8b25a7b1ded0edacd94a79d9d"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "02db5f86ea9e7a678eeebe5985c1b259" -> "8f0b2753cf63b47db45e58d6e4fd7c44"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b7093c5e3a021ef9e61f7a0db6d2fcae" -> "7ce039065d46ba8c385b5808e6670223"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c151674dbcbc1a085261b37fe21088ab" -> "3275de1ab7323156e327644b41f7889d"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f07b32129180eeef032d2b636c69946d" -> "953066fd4a13c3bc7e34a6d4bf7563b9"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6ddef67d1582f24ac0d020bc9e72449f" -> "e5d088d348c7fdc5bb3a4f8bb187a503"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "cfad19a9cf91b2abfc82eeb317eee8b6" -> "cf3ec20c30746dddb6b49de12a33ad5e"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "adcfc5e29eb180df64d8210b6fcfdbc6" -> "e1c18ade5d2ab9df0024c9cc5a7a350f"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "22ee05ebfc08eaee8eeb2175b39642c7" -> "e4a9b6474a5d240567428df48c748baa"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "bb85a9370091b0bbfb6175ff268d645e" -> "4428942c14f94bd547ac32c80e0fc05d"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "5b02798322bddf80bb154e29612e1c7f" -> "390ea0b4bc461ac2a79fe342236780ed"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "ef43aac585b580c5ee4e070f21af1075" -> "8eb5c8186647af4bff5d01e5fc3765e8"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d651b0c4cc267bef137b713a943f1d8e" -> "1b03681bc0ace781a263da3b8505402f"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "65a1007208faa96bf93d944edf2bfd8c" -> "921d030af058b23f90f6a8cdbbc94513"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "71e532075095176ed11332ee8e48a5d1" -> "2f9996acdbc1f6950e469f9efbb0e204"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "8237ed4cbdcea80791bc7a8e089695d2" -> "a70ddb4a85ed8e10fbfcb7654b8a3101"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "c5d79fb3a93aa39fa3e47425eb0b5eeb" -> "935e58e2076c8631f9c33fb5d181c708"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "3f7df2c9ee5178e4fec54698e058e708" -> "86a3d42e95142480f5c7392c4a99b63e"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "MS755qiXjgLVP+X+yFaB6a6xhoLmcUDtI/UksKzmeSg=" -> "tj8P/yEUnokpy16wW5J3nwEJBpobk1L+jaftyFGgXuM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "t5PB/tKfdAJPBOiaHJm2VIYXg2IzGFdfRukyTVsFcSw=" -> "R6YoTKpVzgzNqxgpvlZMlOiDDFrcbP68cz7UCg2AUiw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "EP1oOpdzjoaLVYylnauLPCuOVrInJRIg8S74ctePKwA=" -> "ncbEOVBOK/hyuqaAVjJvI+WTzNMkoyfT2Exr24Ytsbc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "kVgtuNDjZB00+7LZihhItd15GCOq3HDhtt42Owngscw=" -> "+21MoXUyRAu1wuOKfJt8f8bafaCMpzuUkijSuHzX3Yw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "4+jMLJEK5h+0ZUdCWirqhVXZzNvdObpXQHZgn69gejM=" -> "Iz5MZhnupjsb5OavQ7vD1B6xXLSRMlYGhtLdofXwOkE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "q37c5Wmgq84RePz6v9QkhEVuNOg4NndYVQLOTQsPD1o=" -> "PBVU/uldBCvu0Zhc5Qv4TVVpehXjmn0E8OrqG2lfRxs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "uufMUu2rMzYQGZrYWf/GcZ7G2CXnPDSybSVnIUzWLEg=" -> "4EztVerxQPAmbM4M7Vyoho+3yQAwAoMmYa7h2O2HIPQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BzTlkL5pvC4B8zXVE32MGz2VD2SdznqZjhhcoKnInNo=" -> "nIbwCBNQF7QS4ZKGw1uNBn8lKQW/A6RJtkpROaXu8Uc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgpBSWXxx2bgVRmUWMd8VPvq9AACWnxQQGBBxvYl+iY=" -> "Q54bXI1huUyv/M9gLsvkmN+R6vVZgRjYDh1jOqXHniQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "JsMhorwkj2ryJ3WvNhmO1Xwc4n2onciSdNKmVED8cxg=" -> "/VA+mx4O8gKbxHBQw5bMte1sNveH122JH27hFABVGrQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "NTgs+EyV/uC7GAH+q5N6iXEjaOl7VsLmVCjie7TIZts=" -> "hViEwfPL7SXdYAvBUUGKJM9tZITo3uLYkPJRUI04dXE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FuEnSMwco8rGsBlmHZEKCBWYDtGopyQIdiy6j/0foQI=" -> "OHJxCUk/HvgZfAdmKl0FARBdUY6SjWyVly2XPU6mvcQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "ttHHWOjEmrp31tuMIbhutFvmN4CS11e2hegvfoMRpLM=" -> "HNenuy0q3Dk6jow0dNn0HAL58c/64FoGEP+SrnuPjBg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "JMZLwZlG1PaQPeG4/HRaT4o1W4wGjNqL/of2+xyxgR4=" -> "2qlAvR3MbUFnm/0whtoordv/pnaGaYdQQKW+sYLvErU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "+uaM3gisk85HGF3LIIjsl0tmLxIQSdvcU0yj8/G2RBE=" -> "f1yHwsLwVoW3xoXySKV49Dx1NfQkEXNp4TuKwywXyjY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "JQ4HpohmMzVKwIikH2oBswNW/c3W3d42GuSDfXgflfU=" -> "cNIUEcZe92KUZrUIIuk37WkmmzFzWYQHrsoPjiNhHqs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "qbxcaFqfw4wkF/nOtxN6GdS3mUmI8u+5u4obaEY+0Dg=" -> "QPf4FVOyPhtOsV7Caa3CcZtRGwUusoUrZ8BbifKpLI4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "AKGaLAeQWRKB7AFl3ksz/3unRswGmvTBwPWR3ZLaoso=" -> "2zNXS0/YB6SqUUPs/+XdNkwVyPprcpdT21wt0CG4q1I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "PoJcnVG+YKYdI0f0gEM2+YXIqwxC1fBBJuEhze1cGu8=" -> "yjia3R2KQucwW8ag/YHP/rAhUOT3S0fWzuPmaGX5Lqs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZXutaqjc+alJuTTMJ4mZ/R92/OTj7Wmq+Au9+t1dHPo=" -> "9VxXV5L+iPi2Wtp5g+Gifj9JuewvRHzqA3mlspuwws4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "beL+wnKZ2YNJzkhbRdt3vvDTGMQNxASZNtZGrLvaV4s=" -> "la7XAK9H+c6NdWcwwXo3KQetPQlvtdcj4YeaVrHb8pM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "+Oep8s+rgAVQIUjbaAugw6vAhtAXw4aTnZlxxm6CvS8=" -> "iE2kbr9sYghNOF+m4VWqdWhAH11/wSEQ4TdS4qF/G58="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ec4PTpaTCimyooPR9JGzvjNed6ADmS/aHJxS6lnA0L8=" -> "44OIyvjQ6w0yAP1zFZVY77oC2zUFjBP17DwNg8NkrZg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "zKnmt3zAr5FtIkeekRvvlbd+zO4+2+UiVvFRrWOuXgw=" -> "iD6+fhSOVT64rxtln1Kg2aKnzIRRIEnX6Ojb6WTfL40="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ascV00k7JSj/eSSURQvDhxaX2heRLYoO15Kzup+ag/E=" -> "BCeILChcFHdfj1UK3ubNbo3Ftbe1+37juAotGVWyLuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "EfhGUT3tx76l9IJKs/abdDRcPA7ZoNxuYRn7DWKsOSk=" -> "jGeF5jVIQUUQkfi/J58MpNcJGtGNJY8RxjPo8V6VkXA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-19T23:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "qIp7vgSENcUGGXoS7BoW7JJmLJvv5BYlYkQRLL0TCRU=" -> "ME1WPxZyiw/zv6nQTaMYMuToDScui0AMhadA7XUdoTk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "2TqYioqTAyZd9ByLRnYCtGPxtz3cCOiVTUz4K9QprSM=" -> "RwHlcwjZaVukgIOnpdmRPoc47YBkzU5nPQw85FE2mgk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YvDN/QIqMRvslk1rzT14LivaplYSwARGwCxpaHkZsXk=" -> "9h4kNF7oniSWb5ZxgjnlOfDiWFlvVH6Rji4+MqzCbh4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "UkKU6G8Iu7SCSEeADvQGTt6DFwRFdClCJ01Hv3R9u4U=" -> "PxuK5YwaAjbuZWelc52ZQyL/MlW2Vv7ntoc/2Kkbnq0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "6OkfGbruwr2rRZNx4EDL7in1U9yLbhwO0uANc9yHgVc=" -> "YrS5Jb+/Amn+I0qBjuZNKQ/lySdXfxE/ugyaBzU3ntY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hx0mDGJQ8KbYBGGXh+sQggr+ReFQbScbkSVyY2Ux8Fg=" -> "K97gl3Fte3Ud1Fq7UrJTteEkxqCg3mJgQ+AnmCXYY60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "16A2pw8nlFTZMRLJmAaX+WwMPMA1m5dWz8O8pS/qp4w=" -> "PRaSBQik1EcgbdW52FiUmNElH2OX9/WVPUbiZS4V7pM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rNDDl0R1+sp5ZMVYyJyguWE9klc0E/5Qqj1YQ5o78oM=" -> "bj7qL5svOYNiKcJevVtNtKd03yzvE2Eo4XHfBxdbSyI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpgbDZeyoeDYVdL1ThTTXBSnRmWot7tMnJEL33edENA=" -> "t7XITvdVi5CbPPHyLPAunOYY73Xi5fn/tntMZeBp57E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rkNrxroIb5+pGcT/5abm2Zz5zByodb5483DnrG62kTM=" -> "uohIEx2xM94r53bHip7TLScT7ule3ugCQwQ0R85fkg4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "k0N7bTzCsWIFRXUEHAi10mmM2OGGi3KuL48YMwHHUAY=" -> "ut4MysdFvka/8VkKPr7W2QWAE8ng93YtXZ4TDzW+o40="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "lrD03TZ5x+IRsQcP/qO7UX88DflVWTCL6QyciOg1ywk=" -> "Gq2n0doxvIRIvRtZ/71Fj1EMQvXokUdNE/Q5NIfwEnA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOtYEOP7d/6pXABh8Xkzd5nBlNk/bTD8eM+Cf2ZnJYo=" -> "X9D+HUDsVgSvnpaQQ4nIFp6Vs8ANuWPk3Byt+7bA40Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LzMBXltqcyzSOSK6aaUGlcZmCwhZt0ZEKV9futc3Iy8=" -> "fWgBBvtDDHSzFFXnGoOx4Qx8+S34SQGE0iSkeOsc0Kw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "oBYY3VO5AIx9u3oeHyX8prTXubkDk3qzb4Xa7iF65zI=" -> "S7Dy9ptMfObK4sPVKj6BsRYDfZU7JkDP7Psxfcq6VA4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "9rNSPL3EkWYHmivfnK6J2q6H7BTNlns3mRGIUTRyE+E=" -> "JO3mixsAt209DUR6SCXPN6Frjx6U0jP4aETGJoV+LXQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPTtZ/MMAyh8Wt0k4XVAvond94ke04WfNQazPOPu10I=" -> "99KS9S4AZThkr7R+uNsmS/yDOoptoUsxPe1fo1WVbLk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YlSya3dSMroenMmJmokC1/bsZ51e6fR/ZJbnCJvkN9A=" -> "9XPtL152SAQfVamlmiBwWiXdFIZJIrNu7yMMZ7VyKRw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tcl/oaKuGRC8nEcSY+InRV+ZP2OBn6RB2wGeO7c91xg=" -> "XMKQg/ykdAkOZ2I0dy25N0S7wOTRa02KN+U5MnZ9oDY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-12T21:12:02Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "dk0err" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-12T21:12:01Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-12T21:12:00Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*